{
  "basics": {
    "name": "Jason Manshadi",
    "label": "Developer",
    "picture": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/p/7/005/03e/1ea/15eefd0.jpg",
    "email": "jaymanshadi@gmail.com",
    "website": "jacemanshadi.ca",
    "summary": "I am an developer from C++ and Java origins, now focusing on adding wed development to my resume with personal projects listed below.",
    "location": {
      "city": "Vancouver",
      "countryCode": "Canada",
      "region": "British Columbia"
    },
    "profiles": [
      {
        "network": "Resume Source",
        "username": "This Resume is built from this Github Repo",
        "url": "https://github.com/modernNeo/onlineResume"
      },
      {
        "network": "GitHub",
        "username": "modernNeo",
        "url": "https://github.com/modernNeo"
      },
      {
        "network": "Side Projects",
        "url": "http://ec2-52-3-227-202.compute-1.amazonaws.com/"
      }
    ]
  },
  "work": [
    {
      "company": "SAP Canada Inc.",
      "position": "Agile Developer",
      "website": "https://www.sap.com/canada/index.html",
      "startDate": "2017-09-01",
      "endDate": "2018-04-27",
      "summary": "Provided Solution for issues effecting external and internal customers",
      "highlights": [
        "Created a process that automated the installation of necessary programs, SDKs and repositories using Ansible which allowed the developers to spin up new virtual machines with minimal effort.",
        "Created a python script to allow indirect use of Ansible script for easier set-up of VMs from the command line which removed dependence of Ansible knowledge and Jenkins server as well as making it easier to run batch jobs.",
        "Updated existing python script to catch and report incorrect host entries on internal database to ensure that failing hosts could be identified in event of outages effecting production systems.",
        "Gained experience with Mockito and PowerMockito while writing Java Unit Tests to increase code coverage to over 80%.",
        "Participated in bi-weekly regression tests of ORCA’s “Import Data Connection” component to detect any final bugs that existed before ORCA was demoed for partners and customers."
      ]
    },
    {
      "company": "SAP Canada Inc.",
      "position": "Unix Systems Administrator",
      "website": "https://www.sap.com/canada/index.html",
      "startDate": "2016-05-01",
      "endDate": "2016-12-31",
      "summary": "Responded to internal IT tickets raised and diagnosed issues regarding software and hardware issues with virtual and physical machines.",
      "highlights": [
        "Became more familiar with UNIX and Linux operating systems.",
        "Assisted in the migration from NIS to LDAP directory services protocol.",
        "Troubleshooted issues with NIS and LDAP configurations on Linux and UNIX machines.",
        "Created Red Hat and SuSE LDAP enabled templates for vSphere to replace existing NIS templates.",
        "Learned how to create and delete Solaris Zones from scratch and from a standard flar.",
        "Coordinated with HPe, IBM, and Oracle if servers went down and were facing hardware failures.",
        "Assisted in the maintenance outage with involved shutting down the Solaris, Red Hat, SuSE, AIX and HP-UX machines, bring them back up and deal with the software and hardware failures that arised"
      ]
    },
    {
      "company": "Ritchie Bros. Auctioneers",
      "position": "Systems Integrator",
      "website": "https://www.rbauction.com/",
      "startDate": "2014-09-01",
      "endDate": "2016-04-30",
      "summary": "Customizes the development and production JIRA environments for individual project and team purposes.",
      "highlights": [
              "Administered and enhanced the JIRA installation to make it one of the company's most-used IT service desk systems.",
              "Led upgrade process for JIRA environments which involved researching needed steps for upgrading, coordinating with multiple colleagues for setting up and testing the environment.",
              "Created a PowerShell script for automating the process of creating user, activating users and deactivating uses in any specified Salesforce organization",
              "Wrote a manual to allow for inexperienced users to use the SalesForce JIRA project and SalesForce Service Desk project.",
              "Cleaned sales on Postgres Database which required contacting all departments and individual who used sales and customizing the cleaning script to take their sales into account",
              "Created, configured, and maintained Linux virtual machines to for development and QA.",
              "Handled software and hardware inventories and improving the hardware management process to prevent future losses.",
              "Learned how to add, remove and modify users on Windows Active Directory using PowerShell"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "SFU CSSS",
      "position": "CSSS Systems Administrator",
      "website": "Website: IN DEVELOPMENT",
      "startDate": "2016-05-01",
      "endDate": "2020-04-30",
      "summary": "d multiple servers that were used by the CSSS as well as managing the Github and Google Drive.",
      "highlights": [
        "Greatly improved the process for setting up permissions for CSSS Executives on necessary services used by the CSSS",
        "Research and implemented a password management system to replace the old system being used."
      ]
    },
{
      "organization": "SFU CSSS",
      "position": "CSSS WebMaster",
      "website": "Website: IN DEVELOPMENT",
      "startDate": "2016-05-01",
      "endDate": "2020-04-30",
      "summary": "Revamping the CSSS website "
    }
  ],
  "education": [
    {
      "institution": "Simon Fraser University",
      "area": "Computing Science",
      "studyType": "Bachelor",
      "startDate": "2015-05-01",
      "endDate": "2020-04-30",
      "courses": [
        "DB1101 - Basic SQL",
        "CS2011 - Java Introduction"
      ]
    },
    {
      "institution": "Langara College",
      "area": "Computer Science",
      "studyType": "Associates",
      "startDate": "2011-09-01",
      "endDate": "2015-06-04"
    }
  ],
  "skills": [
    {
      "name": "Object-Oriented Languages",
      "level": "Intermediate",
      "keywords": [
        "C++",
        "C",
        "Java",
        "Golang",
        "C#",
        "Java",
        ".NET"
      ]
    },
    {
      "name": "Scripting Languages",
      "level": "Intermediate",
      "keywords": [
        "Bash",
        "Python",
        "Perl",
        "AWK",
        "Powershell"
      ]
    },
    {
      "name": "Web Languages",
      "level": "Intermediate",
      "keywords": [
        "Django",
        "JavaScript",
        "MEAN stack",
        "HTML",
        "CSS"
      ]
    },
    {
      "name": "Operating Systems",
      "level": "Intermediate",
      "keywords": [
        "Mac",
        "Windows",
        "Linux",
        "UNIX"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }, 
    {
      "language": "Faris (Persian)",
      "fluency": "Conversational"
    }
  ],
  "interests": [
    {
      "name": "Computer Architecture"
    },
    {
      "name": "Networking"
    },
    {
      "name": "Comic-Book Enthusiast"
    }
  ]
}